# Без использования collections, написать программу, которая будет создавать словарь
# для подсчитывания количества вхождений каждой буквы в текст введенный с клавиатуры
# text = input("Введите текст")
# objs = {i: text[i] for i in range(len(text.count()))}
# print(objs)

# text = "HELLO"
# data = dict(enumerate(text))
# # print(data)