# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)
def azbuka(text):
    morze = {
             'a': '.—', 'b': '—...', 'c': '—.—.', 'd': '—..', 'e': '.', 'f': '..—.', 'g': '——.', 'h': '....', 'i': '.',
             'j': '.———', 'k': '—.—', 'l': '.—..', 'm': '——', 'n': '—.', 'o': '———', 'p': '.——.', 'q': '——.—',
             'r': '.—.', 's': '...', 't': '—', 'u': '..—', 'v': '...—', 'w': '.——', 'x': '—..—', 'y': '—.——',
             'z': '——..'
             }
    text = text.lower().split()
    text = ' '.join(text)
    for i in text:
        for key, values in morze.items():
            if i == key:
                print(values, end=" ")
    return "- код морзе"

print(azbuka(input()))